<?php

/*
 * Fix wrong layout text cyrillic words typed in latin
 *
 * @author Taras Shkodenko <taras@shkodenko.com>
 *
 */


function convertLayout($text)
{
    // Масив відповідностей між англійською та українською розкладками
    $layoutMap = [
        'q' => 'й', 'w' => 'ц', 'e' => 'у', 'r' => 'к', 't' => 'е', 'y' => 'н', 'u' => 'г',
        'i' => 'ш', 'o' => 'щ', 'p' => 'з', '[' => 'х', ']' => 'ї', 'a' => 'ф', 's' => 'і',
        'd' => 'в', 'f' => 'а', 'g' => 'п', 'h' => 'р', 'j' => 'о', 'k' => 'л', 'l' => 'д',
        ';' => 'ж', '\'' => 'є', 'z' => 'я', 'x' => 'ч', 'c' => 'с', 'v' => 'м', 'b' => 'и',
        'n' => 'т', 'm' => 'ь', ',' => 'б', '.' => 'ю', '`' => 'ґ', 'Q' => 'Й', 'W' => 'Ц',
        'E' => 'У', 'R' => 'К', 'T' => 'Е', 'Y' => 'Н', 'U' => 'Г', 'I' => 'Ш', 'O' => 'Щ',
        'P' => 'З', '{' => 'Х', '}' => 'Ї', 'A' => 'Ф', 'S' => 'І', 'D' => 'В', 'F' => 'А',
        'G' => 'П', 'H' => 'Р', 'J' => 'О', 'K' => 'Л', 'L' => 'Д', ':' => 'Ж', '"' => 'Є',
        'Z' => 'Я', 'X' => 'Ч', 'C' => 'С', 'V' => 'М', 'B' => 'И', 'N' => 'Т', 'M' => 'Ь',
        '<' => 'Б', '>' => 'Ю', '~' => 'Ґ', '@' => '"', '#' => '№', '$' => ';', '^' => ':',
        '&' => '?', '|' => '/', '\\' => '\\', '/' => '.', '?' => ',', '-' => '-', '_' => '_',
        '=' => '=', '+' => '+', '*' => '*', '(' => '(', ')' => ')', '%' => '%', ' ' => ' '
    ];

    // Конвертація тексту
    $convertedText = '';
    for ($i = 0; $i < mb_strlen($text); $i++) {
        $char = mb_substr($text, $i, 1);
        $convertedText .= array_key_exists($char, $layoutMap) ? $layoutMap[$char] : $char;
    }

    return $convertedText;
}

if (isset($argv[1])
    && (strlen($argv[1]) > 0)
) {
    echo convertLayout($argv[1]) . PHP_EOL;
} else {
    echo "Script usage: php " . $argv[0] . " [Some Text To Fix Layout]\n";
}
