import sys

def convert_layout(text):
    layout_map = {
        'q': 'й', 'w': 'ц', 'e': 'у', 'r': 'к', 't': 'е', 'y': 'н', 'u': 'г',
        'i': 'ш', 'o': 'щ', 'p': 'з', '[': 'х', ']': 'ї', 'a': 'ф', 's': 'і',
        'd': 'в', 'f': 'а', 'g': 'п', 'h': 'р', 'j': 'о', 'k': 'л', 'l': 'д',
        ';': 'ж', '\'': 'є', 'z': 'я', 'x': 'ч', 'c': 'с', 'v': 'м', 'b': 'и',
        'n': 'т', 'm': 'ь', ',': 'б', '.': 'ю', '`': 'ґ', 'Q': 'Й', 'W': 'Ц',
        'E': 'У', 'R': 'К', 'T': 'Е', 'Y': 'Н', 'U': 'Г', 'I': 'Ш', 'O': 'Щ',
        'P': 'З', '{': 'Х', '}': 'Ї', 'A': 'Ф', 'S': 'І', 'D': 'В', 'F': 'А',
        'G': 'П', 'H': 'Р', 'J': 'О', 'K': 'Л', 'L': 'Д', ':': 'Ж', '"': 'Є',
        'Z': 'Я', 'X': 'Ч', 'C': 'С', 'V': 'М', 'B': 'И', 'N': 'Т', 'M': 'Ь',
        '<': 'Б', '>': 'Ю', '~': 'ґ', '@': '"', '#': '№', '$': ';', '^': ':',
        '&': '?', '|': '/', '\\': '\\', '/': '.', '?': ',', '-': '-', '_': '_',
        '=': '=', '+': '+', '*': '*', '(': '(', ')': ')', '%': '%', ' ': ' '
    }

    converted_text = ''.join([layout_map.get(char, char) for char in text])
    return converted_text

if __name__ == "__main__":
    if len(sys.argv) != 2:
        print("Використання: python3 fix-layout.py <текст для перекодування>")
        sys.exit(1)

    input_text = sys.argv[1]
    print(convert_layout(input_text))
